erp3l/src/Catalogs/ВидыСчетовФИ/ВидыСчетовФИ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыСчетовФИ</name>
  <predefined>
    <items>
      <name>СчетВзаиморасчетов</name>
      <description>Счет взаиморасчетов</description>
    </items>
    <items>
      <name>СчетВзаиморасчетовСПлательщиком</name>
      <description>Счет взаиморасчетов в плательщиком</description>
    </items>
    <items>
      <name>СчетВыбытияНКД</name>
      <description>Счет выбытия НКД</description>
    </items>
    <items>
      <name>СчетДБП</name>
      <description>Счет ДБП</description>
    </items>
    <items>
      <name>СчетДоходовОтПереоценки</name>
      <description>Счет дохода от переоценки</description>
    </items>
    <items>
      <name>СчетДоходовОтВыбытия</name>
      <description>Счет доходов от выбытия</description>
    </items>
    <items>
      <name>СчетНачисленияКомиссий</name>
      <description>Счет начисления комиссий</description>
    </items>
    <items>
      <name>СчетНачисленияКупонов</name>
      <description>Счет начисления купонов</description>
    </items>
    <items>
      <name>СчетНачисленияПроцентов</name>
      <description>Счет начисления процентов</description>
    </items>
    <items>
      <name>СчетНКД</name>
      <description>Счет НКД</description>
    </items>
    <items>
      <name>СчетНоминала</name>
      <description>Счет номинала</description>
    </items>
    <items>
      <name>СчетРасходовОтПереоценки</name>
      <description>Счет расхода от переоценки</description>
    </items>
    <items>
      <name>СчетРасходовОтВыбытия</name>
      <description>Счет расходов от выбытия</description>
    </items>
    <items>
      <name>СчетРБП</name>
      <description>Счет РБП</description>
    </items>
    <items>
      <name>СчетУчетаДисконта</name>
      <description>Счет учета премии / дисконта</description>
    </items>
    <items>
      <name>СчетУчетаДисконтаПлательщика</name>
      <description>Счет учета премии / дисконта плательщика</description>
    </items>
    <items>
      <name>СчетУчетаФИ</name>
      <description>Счет учета финансового инструмента</description>
    </items>
  </predefined>
  <tabularSections>
    <name>ВидыФИ</name>
    <attributes>
      <name>ВидФИ</name>
      <type>
        <types>EnumRef.ВидыФинансовыхИнструментов</types>
      </type>
    </attributes>
    <attributes>
      <name>Актив</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Счет</name>
      <type>
        <types>ChartOfAccountsRef.Хозрасчетный</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидимостьВДокументах</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>300</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

erp3l/src/Catalogs/ВидыСчетовФИ/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ОбновлениеПредопределенных() Экспорт

	ТабДок = ПолучитьМакет("СчетаФИ");
	
	Таб = Новый ТаблицаЗначений;
	Таб.Колонки.Добавить("ИмяВидСчетаФИ");
	Таб.Колонки.Добавить("ВидФИ");
	Таб.Колонки.Добавить("Актив");
	Таб.Колонки.Добавить("КодСчета");
	Таб.Колонки.Добавить("ВидимостьВДокументах");
		
	Для каждого ОбластьВидФИ Из ТабДок.Области Цикл
		
		Мас = СтрРазделить(ОбластьВидФИ.Имя, "_");
		
		ТекВидФИ = Перечисления.ВидыФинансовыхИнструментов[Мас[0]];
		ТекАктив = ?(Мас.Количество() > 1, Мас[1] = "Актив", Ложь);
		
		Для НомерСтроки = ОбластьВидФИ.Верх По ОбластьВидФИ.Низ Цикл
			
			НоваяСтрока = Таб.Добавить();
			НоваяСтрока.ИмяВидСчетаФИ			= ТабДок.Область(НомерСтроки,1).Текст;
			НоваяСтрока.ВидФИ 					= ТекВидФИ;
			НоваяСтрока.Актив 					= ТекАктив;
			НоваяСтрока.КодСчета 				= ТабДок.Область(НомерСтроки,2).Текст;
			НоваяСтрока.ВидимостьВДокументах	= ТабДок.Область(НомерСтроки,3).Текст;
			
		КонецЦикла;
	
	КонецЦикла;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Хозрасчетный.Ссылка КАК Ссылка,
	|	Хозрасчетный.Код КАК Код
	|ИЗ
	|	ПланСчетов.Хозрасчетный КАК Хозрасчетный
	|ГДЕ
	|	Хозрасчетный.Код В(&Код)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВидыСчетовФИ.Ссылка КАК Ссылка,
	|	ВидыСчетовФИ.ИмяПредопределенныхДанных КАК ИмяПредопределенныхДанных
	|ИЗ
	|	Справочник.ВидыСчетовФИ КАК ВидыСчетовФИ");
	Запрос.УстановитьПараметр("Код", Таб.ВыгрузитьКолонку("КодСчета"));
	Результат = Запрос.ВыполнитьПакет();
	
	СчетаПоКоду = Результат[0].Выгрузить();
	СчетаПоКоду.Индексы.Добавить("Код");
	
	Таб.Индексы.Добавить("ИмяВидСчетаФИ");
	Выборка = Результат[1].Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Объект = Выборка.Ссылка.ПолучитьОбъект();
		Объект.ВидыФИ.Очистить();
		
		СтрокиВидыФИ = Таб.НайтиСтроки(Новый Структура("ИмяВидСчетаФИ", Выборка.ИмяПредопределенныхДанных));
		Для каждого СтрокаВидФИ Из СтрокиВидыФИ Цикл
			
			Если СтрокаВидФИ.КодСчета = "" Тогда
				Продолжить;			
			КонецЕсли;
			
			СтрокаТаб = Объект.ВидыФИ.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТаб, СтрокаВидФИ);
			СтрокаТаб.Счет = СчетаПоКоду.Найти(СтрокаВидФИ.КодСчета, "Код").Ссылка;
		
		КонецЦикла;
		
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(Объект);
		
	КонецЦикла;
	
КонецПроцедуры

#КонецЕсли
